[
  {
    "id": 2,
    "owner": 1,
    "title": "They are left without means of transportation to leave the island and return home!",
    "to_another": true,
    "dreamer": 1,
    "categories": [2],
    "content": "In a few days, hundreds of people in the delta will be without public transport. The shipping company Francisco Buiatti e Hijos S.A. (line 450, “El Jilguero”) wants to stop providing essential services that allow them to access work, education and health care. These people need your help to prevent this!\r\n\r\nWhat are they asking for?\r\nThey need to pay the transport company a monthly fee for 2 trips per day:\r\n- At 8 p.m. Departure from the Tigre river terminal.\r\n- The 7-hour tour departs from Paraná and Toledo, passes through Arroyo Espera and ends at 9:30 a.m. at the river terminal.\r\n\r\nMany families use these boats to go to work, take children to school and visit hospitals.",
    "goal": "2000.00",
    "photo_url": null,
    "thumbnail_url": null,
    "status": "Active",
    "created_at": "2025-04-09T23:56:42.796016-03:00",
    "number_donations": 0,
    "total_amount_donations": 900,
    "number_comments": 1,
    "number_views": 3
  },
  {
    "id": 14,
    "owner": 9,
    "title": "Dreams unite us. Support the girls and boys of Mexico in achieving their dreams",
    "to_another": true,
    "dreamer": 15,
    "categories": [7, 3, 1, 8],
    "content": "Do you remember what you dreamed of when you were a child?\r\nMaybe you wanted to be an astronaut, an artist, a teacher, an engineer, a doctor, or a lawyer... Behind every dream we achieved, there was someone who supported us. Today, you can be that person for thousands of children in Mexico who need an opportunity.\r\n\r\nToday, you can help more children in Mexico and around the world have the chance to dream of a better future.\r\n\r\nIn Mexico...\r\n\r\n1 in 2 children or adolescents suffers from violence.\r\n1 in 8 children under the age of 5 suffers from chronic malnutrition.\r\n8 in 10 indigenous children and adolescents live in poverty.\r\n4 in 10 children ages 0 to 5 live in poverty.\r\n\r\nMore than 10 million children with severe malnutrition do not receive treatment.\r\n\r\nAt UNICEF, we are present in Mexico and around the world, providing food, water, education, psychosocial support, and protection to those most in need.\r\n\r\nWhat can you do?\r\nCelebrate the child you once was by supporting today's children. Your donation can result in:\r\n\r\nSchool kits for children to return to school.\r\nTreatment for children with acute malnutrition.\r\nSafe spaces and medical care for migrant children.\r\nReconstruction of schools affected by disasters.",
    "goal": "15000.00",
    "photo_url": null,
    "thumbnail_url": "/dream-helper/img/home-page/dream1.png",
    "status": "Active",
    "created_at": "2025-04-10T18:57:21.584985-03:00",
    "number_donations": 0,
    "total_amount_donations": 1900,
    "number_comments": 3,
    "number_views": 7
  },
  {
    "id": 13,
    "owner": 9,
    "title": "Help please Mateo!",
    "to_another": false,
    "dreamer": null,
    "categories": [1],
    "content": "Mateo is a 9 year old boy with a musculoskeletal disorder... he suffers from hydrocephalus, due to lack of therapy his muscles are atrophying and he is losing strength. Thanks to therapy he has achieved a lot: he can now stand and walk. He MUST continue therapy to improve his quality of life, which he does not have access to due to lack of payment o.s.c.t.c.p.",
    "goal": "650.00",
    "photo_url": "http://localhost:9000/dreams-media/dreams/13-5a0a7d1b-187b-43a1-997e-406241a6914f-mateo.jpg",
    "thumbnail_url": "http://localhost:9000/dreams-media/mini-dreams/13-5a0a7d1b-187b-43a1-997e-406241a6914f-mateo.jpg",
    "status": "Active",
    "created_at": "2025-04-10T18:00:42.298350-03:00",
    "number_donations": 0,
    "total_amount_donations": 120,
    "number_comments": 1,
    "number_views": 2
  },
  {
    "id": 8,
    "owner": 1,
    "title": "More than 30 years of waiting",
    "to_another": false,
    "dreamer": 10,
    "categories": [6],
    "content": "The eastern bank of the Quin Manzano River, located in the province of Neuquén, has been waiting for more than 30 years for a bridge to be built that would improve the situation and make it safe for locals to cross the river. Without a bridge or other effective crossing, residents are forced to cross the river to access basic services such as shops, health care and education.\r\n\r\nThe current situation is not only a huge inconvenience, but also a real threat to the safety of people living in this region. The accident rate when crossing the river is a clear manifestation of this risk. This problem has been going on for three decades, and during this period there have been many improvements in infrastructure at the national and global levels. However, Quin Manzano is still ignored.",
    "goal": "100000.00",
    "photo_url": "http://localhost:9000/dreams-media/dreams/8-a403167e-4dd4-465d-8afe-ee4a738f2b95-puente.jpg",
    "thumbnail_url": "http://localhost:9000/dreams-media/mini-dreams/8-a403167e-4dd4-465d-8afe-ee4a738f2b95-puente.jpg",
    "status": "Active",
    "created_at": "2025-04-10T12:12:14.423764-03:00",
    "number_donations": 0,
    "total_amount_donations": 5000,
    "number_comments": 11,
    "number_views": 16
  },
  {
    "id": 11,
    "owner": 3,
    "title": "Support Darinka!",
    "to_another": true,
    "dreamer": 13,
    "categories": [1],
    "content": "Daryna is the only child in the family who has been fighting for her right to a full life since birth. Her journey has been difficult and full of hardships. Even before her birth, doctors made difficult diagnoses, and at five months old she began to have seizures, after which she lost all the skills she had mastered.\r\n\r\nNow Daryna is 2 years old, and she has only recently learned to roll over and sit with the support of her hands. She still has a difficult and long way ahead of her, but we believe she is capable of more. Her diagnoses include brain developmental disorder, symptomatic epilepsy, and delayed psycho-linguistic and statokinetic development.\r\n\r\nDaryna needs constant rehabilitation: physical therapy, sensory integration, lessons with a speech therapist, swimming pool, etc. Classes with qualified specialists are already yielding excellent results, improving the girl's physical and emotional state. There is progress, and it is important for her development!\r\n\r\nHowever, all this requires a lot of money, which the family does not have at the moment. Your contribution is a chance for Daryna to be like other children: to play, walk and learn.\r\n\r\nDo not be indifferent, help our little heroine to get a chance for a happy childhood! Each of your contributions is an important step towards helping Daryna take her first independent steps, enjoy every day and be healthy.\r\n\r\nPlease support Daryna! Together we can make her life better!",
    "goal": "750.00",
    "photo_url": null,
    "thumbnail_url": "./dream-helper/img/home-page/dream2.png",
    "status": "Active",
    "created_at": "2025-04-10T12:40:06.433337-03:00",
    "number_donations": 0,
    "total_amount_donations": 250,
    "number_comments": 0,
    "number_views": 0
  },
  {
    "id": 6,
    "owner": 1,
    "title": "Animals that experience war – help the zoo",
    "to_another": true,
    "dreamer": 8,
    "categories": [4],
    "content": "Last spring, the Kharkiv Zoo opened its doors to visitors for the first time since the beginning of the full-scale invasion.\r\n\r\nFor the third year in a row, the institution is learning to survive in war conditions and constantly needs support.\r\n\r\nCurrently, visiting the facility is free, which means that the zoo does not receive any profit and survives at the expense of benefactors.\r\n\r\nThe Kharkiv Zoo has an important historical value, and is also an object of the Kharkiv Natural Reserve Fund of national importance. This is the first zoo in Ukraine (founded in 1895), and also one of the twenty oldest in the world.\r\n\r\nIn terms of the value of the collection, the zoo ranks second in Ukraine — after the Kyiv Zoo. More than 384 species of animals are preserved in the zoological park, which is 8 thousand individuals, including fish, amphibians, reptiles, birds, mammals, etc.\r\n\r\nOur goal is to provide the zoo with 1,500 kg of meat (approximately 100 kg of meat is needed per day to feed the animals). The zoo itself has the following types of carnivores: bears, wolves, hyenas, lions, lynxes, and tigers.\r\n\r\nWe have been actively supporting the zoo since the beginning of the full-scale invasion, and as part of the project we have already bought food for the animals for UAH 14,080, but this aid is not enough, the animals need our support.\r\n\r\nThank you for your concern!",
    "goal": "850.00",
    "photo_url": "http://localhost:9000/dreams-media/dreams/6-53456ab8-aba0-4dac-b913-628606b2fbd8-hijo.jpg",
    "thumbnail_url": "http://localhost:9000/dreams-media/mini-dreams/6-53456ab8-aba0-4dac-b913-628606b2fbd8-hijo.jpg",
    "status": "Active",
    "created_at": "2025-04-10T11:34:26.054312-03:00",
    "number_donations": 0,
    "total_amount_donations": 100,
    "number_comments": 3,
    "number_views": 4
  },
  {
    "id": 9,
    "owner": 3,
    "title": "Children's school assistants",
    "to_another": true,
    "dreamer": 11,
    "categories": [7],
    "content": "In the modern world, education plays a key role in the development and formation of personality. Every child has the right to quality education and development. Stationery helps children in the learning process. It plays an important role in the life of schoolchildren, helps them learn, develop and feel comfortable in the learning process, develop creative skills, fine motor skills, coordination of movements and visual perception. Unfortunately, not all children have the necessary materials and tools for learning.\r\n\r\nIn our Center for Social and Psychological Rehabilitation, children not only receive psychological, social, speech therapy, but also have the opportunity to feel like real children. We create an atmosphere of family, support and care for them. They find new friends, go to additional classes, do homework with social teachers in our Center and of course, like all children, go to school. Therefore, like all schoolchildren, they need high-quality school supplies that will help them in the learning process. Your help will provide children with the necessary stationery, which will positively affect their academic performance and motivation to study.\r\n\r\nWe need your financial support in order to provide 12 children living in our Center for Social and Psychological Assistance in Kyiv with the necessary stationery (notebooks, pencils, ballpoint pens, colored cardboard, paper, brushes, glue, scissors, etc.) and to pay the salary of a social worker who works with children. Give children the opportunity to receive quality knowledge and develop in comfortable conditions.",
    "goal": "250.00",
    "photo_url": null,
    "thumbnail_url": "/dream-helper/img/home-page/dream1.png",
    "status": "Active",
    "created_at": "2025-04-10T12:25:32.305861-03:00",
    "number_donations": 0,
    "total_amount_donations": 20,
    "number_comments": 3,
    "number_views": 10
  },
  {
    "id": 12,
    "owner": 3,
    "title": "Olia is the second sick child in her family",
    "to_another": true,
    "dreamer": 14,
    "categories": [1],
    "content": "Four years ago, when Olia was five years old, she and her parents went to visit her grandmother. It was hot summer weather outside, so they didn't pay the necessary attention to Olia's thirst, which was making her very thirsty. The girl had a good appetite and a good mood, which did not raise suspicions of illness. But a strange thing happened – Olia was too fond of sweets and ate a lot of them. A blood sugar test suggested by the doctor revealed a very high reading. Unfortunately, the fears came true: the girl was diagnosed with insulin-dependent diabetes. And then – as with all children with this diagnosis – resuscitation, drips, tears.\r\n\r\nThen the family was in trouble again. Again, because Olia's brother had been suffering from diabetes for several years. The girl became the second sick child of her parents. It was more difficult for her mother with her daughter than with her son. The little girl did not understand her illness, why she could not eat when she wanted and as much as she wanted, why she constantly needed to pierce her fingers to measure glucose levels and inject insulin. But time goes on, children grow up. Olia is already graduating from the third grade. Doctors assured her mother that diabetes is a way of life. But her mother believes that diabetes is a hard day's work that requires attention around the clock. The woman has no medical education, but over the years she has become an endocrinologist for her children.\r\n\r\nThe parents work hard to provide their children with everything they need. But it is difficult to support one child with diabetes. With two children, it is even more difficult. Unfortunately, it is not always possible to provide Olia with everything she needs, including the means to constantly monitor her sugar levels. That's why her mother is asking for help.",
    "goal": "500.00",
    "photo_url": null,
    "thumbnail_url": "/dream-helper/img/home-page/dream2.png",
    "status": "Active",
    "created_at": "2025-04-10T12:51:28.209307-03:00",
    "number_donations": 0,
    "total_amount_donations": 300,
    "number_comments": 0,
    "number_views": 1
  }
]
